.planning/case_profiles/case_024_v64_cavity_v2_dicts/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// Laminar regime — Re ≤ 1000, well below cavity transition Re_crit ≈ 7,500
// (Auteri, Quartapelle & Vigevano 2002). NO turbulence model.
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}

simulationType  laminar;

// ************************************************************************* //
